Repository: mozilla-l10n/mt-training-data
Catalog: bft/bft_pontoon.tmx
Source language: en_us
Languages: bft

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
bft: یانگلا یو آر ایل کن چوق یری پسندیدہ ڈاون لوڈ کن یودپی سیکھہ نقل بیا یا سپیاربہ نینید۔ دونگ 12 گھنٹینگ ستورے گوین، اما یانگلا دی صفحیکھہ یونگ ینگ فچوا اونگمہ نینید۔

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
bft: یانگلا کی-بورٹی لمچھٹ کن سہ کولبہ نینید: { sc-review-form-button-approve-shortcut } چھدکھہ بیوفری ،{ sc-review-form-button-reject-shortcut } مین زیربو فری، { sc-review-form-button-skip-shortcut } سکیوربو فری۔

source: You can choose to make your username public or anonymous.
bft: یانگلا یری کولبی مینتخ پو میونگلا تھونمو بیو میبیو غدامہ نینید

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
bft: یانگلا ڈیٹا سیٹی صفحیکھہ گوا نینید، سکتپو نہ سکتی ہلتا بزونگ غدوم، دیکھنہ ڈاون لوڈ بیوس۔ فاٸل کن میٹا ڈیٹا نہ زھمچوکسے یودپن، سکتی کھور کھاری معلومات نہ چھدکھہ سونگسے یودپی ڈیٹا نہ یمبو۔ ڈیٹا سیٹپو ڈاون لوڈ بیالا یانگلا ای میل چی چک منمہ رگوسپن۔

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
bft: یناگلا یری سکتپو شیزدے بینچی، کامن وایسی پروفایل چی فوچوسے تھوتھیکھ میدتپی چوقلا تھوبی ڈیتا سیٹ فچوفری روخ بیا نینید

source: You can meet others in the Mozilla language communities by joining <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
bft: یانگلا موزیلا پی سکت کھنینگ نو ایونگنہ سہ تھوکپہ نگیند، کڑا کوڑو بینچی، چی بزویکھہ سپیرا تنگین یا میٹرکس پو ژار جہلتا لا

source: You cannot add multiple sentences for a single submission
bft: چک سکانگمہ لا یانگلا تم سیر ایشن کلبہ نین مید

source: You cannot request your recordings while another request is already in progress.
bft: اگر جوفل چک دونوک بیسے یودنارے، یانگلا ینگ ریکارڈینگ چی لا جوفل بیا نین مید۔

source: You can request a new takeout of your recordings every { $days } days.
bft: یانگلا{ $days } یری ریکارڈینگ پو فیونگسے فونگ زیرے جوفل چی بیا نینید۔

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
bft: میونگلا روخ بے چوکپہ لا یانگلا ریل فودچی بیانینید۔ دیو یانگلا بدونگو گوید۔ یانگلا آن لاٸن ویڈیو می دمسی ریل فود بیا نینید یا میدنارے میونگنہ تھوک بزوے گوا بیسے سہ بیا نیند۔ ریل فود بے لوکھسینگ نٸی رگوسچیس کن نہ ٹیمپلٹس کن لا ہلتوس۔

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
bft: یانگلا ژھونژے تم سیر کن زدمسے ایڈ بیا نینید، میدنارے یانگلا گٹ ہب کولینگچی چھقپہ گنگرے تم سیر کن کلبہ نینید۔ ایتو یوق تم سیرکن سی سی زیرو یا ہرمق تھونگ دوکپہ رگوسپن یا یانگلا یری رولنہ سہ ربیا نینید۔

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
bft: یانگلا کولبہ نینید <scraperLink> تم سیر فیونگچیس پو </scraperLink> ویکیپیڈینگنہ ژھونژے تم سیر کن فیونگمہ لا۔

source: You check whether the transcription matches the audio
bft: یانگنی ٹرانسکرپشن پونا سکت پو ژوخ ژوخ یودا مید ہلتین۔

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
bft: یانگلا ویب ساٸٹ پو ہڑکیمہ نینید، مثلا کامن واٸس۔ https://commonvoice.mozilla.org/

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
bft: یانگلا اکیڈمک ریفرینسی تھونگ بزو ہڑکیمہ نینید، مثلا ہارورڈ پی تھونگ بزو، موزیلا 2021 کامن واٸس۔ دیکھہ تھوبید https://commonvoice.mozilla.org/ تھونسید 15 ستمبر 2021

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
bft: نانگلا یا فرین کن چوقلا تھونفچوکپہ فری سوشل میڈیاٸی ملسونگ کولبہ نینید۔ میونگلا شوٹ چوکپہ فری پوسٹ کن میونگلا تھونچوک، چوقنہ تھوگین دوک، میونگی سکتی لوکھسینگ تنگمی سپیرونگ مثلا سکتی حق کن، اے آٸی سکت، یا ٹیکنالوجی لوکھسینگ یودپی ڈرانزونگ۔ سوشل میڈیاٸی ہرمق دمسی بارینگ ینگسہ ہلتوس، دووینگنو یانگی ینگ ریسپہ چک کولبی کولچیس کن سہ گریمسے یود۔

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
bft: یانگی گا سکت پو سہ غدمفہ مید۔ سکت غدم بیالا یری پروفاٸل پینگ سونگ جوو۔

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
bft: یانگ دی صحفووی سکنگ لوکھسنہ زومسے حد پو پورا بیسید۔ اے تم سیر پو سکانگمو پژے دونلا منٹ چی بقچی دوت۔ یری تھیق لوکھپولا انچن شیزدے۔

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
bft: یانگی دی صحفووی سکنگ لوکھسنہ زومسے حد پو پورا بیسید۔ اے تم سیر پو سکانگمو پژے دونلا کوچک دوت۔ یری تھیق لوکھ پولا انچن شیردے زیرید۔

source: You have unsaved changes on this page. If you change the locale, your changes will not be saved. Are you sure you want to change the locale?
bft: یانگی سی دی ملسیکھہ زگونگفونگ فسقسے مید۔ یانگ دی ملسینگنو سترانگ بانگچی بیسنارے، یانگی زگونگفونگ فسقسے می کھڈپن۔ یانگ چھدکھیکھہ دی ملسوفنگسے گوینا

source: You have unsaved changes on this page. If you leave this page, your changes will not be saved. Are you sure you want to leave this page?
bft: یانگی سی دی ملسیکھہ زگونگفونگ فسقسے مید۔ یانگ دی ملسوفنگسے سونگنارے، یانگی زگونگفونگ فسقسے می کھڈپن۔ یانگ چھدکھیکھہ دی ملسوفنگسے گوینا؟

source: You must allow microphone access.
bft: یانگلا ماٸکروفون لا ازن منمہ رگوسید

source: You need to be able to hear every word of the recording. We want machine learning algorithms to be able to handle a variety of background noise, and even relatively loud noises or quiet background music can be accepted provided that they don’t prevent you from hearing the entirety of the text. Crackles or ‘breaking up’ that prevent you hearing the text means you should reject the clip.
bft: ندانگلا ریکارڈینگی تم گانگمہ کوا شیسپہ رگوسپن۔ نٸی تونگو یو یود کہ مشینی ہلژپ لوکھسی الگوریدم پو لا گیپ کھوقنہ اونگمی ہڑینگ گانگمہ نوزین گوا رگوسپن، دوپژے سہ زینگ زانگ بینگ اونگمی سکت کن نہ کولے اونگمی خلوسکت کن سہ نوزین گوین، تاکہ یانگلا ٹیکسٹ پو لیخمویکھہ سنا بیا نگینوک۔ چی سکت می سکت کن اگر دونگی یانگلا سنا بیالا ہرکپلس بیسنارے کلپ پو چوق زگوق۔

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
bft: یری زیر جوخپو یانگی تم چک زیربہ نوزین گوین۔ دی تھونگبزو یانگ گار دوکفن نا گار ژھرفن زیربو نا زومسے دوکپن، یانگی زیربی اے سکت کن نا ینگسہ وجوہات یودپن۔ یانگلا دیکھہ بیور بیور معلومات کن منمہ نینید۔

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
bft: یری ریکارڈینگ کن کامن وایسی ڈیٹا سیٹ پینگ خٹپن۔ یانگی یری پرفایل پو فچیکفی جوکلا ینگ یری سکتی ریکارڈینگ کن فچیک زیرے جوفل بیا نینمہ مید۔

source: Your daily goal has been created
bft: یری جغی خسم لوکھ پو فچوسید

source: Your dataset is downloading!
bft: یری ڈیٹا سیٹپو ڈاون لوڈ گوین یود

source: Your download has started.
bft: یری ڈاون لوڈ پو گوا ریاقسید

source: You’re contributing to a target segment
bft: یانگی چوقپہ ژہ ژہ لس چی لا روخ بین یودپن

source: You’re contributing to our first target segment
bft: یانگی نیی سینگپہ گمگیوے لس پو لا روخ بین یودپن

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
bft: تہ یانگلا کامن واٸسی رولنہ ای میل چی مقصدی بارینگ ایتو فیونگما، یری لس بزوے خبر اتارچی دیکھنہ خبری خط بط چی میتھوبن۔

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
bft: تنہ یانگلا کامن واٸسی رولنہ ای میل چی مقصدی بارینگ ایتو فیونگما، یری لس بزوے خبر اتارچی دیکھنہ خبری خط بط چی تھوبن۔

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
bft: یانگ ایشن شوخمو گوین یود۔ تم سیر پو صحیح اینا مین ہلتا لا ٹھین چی دود جوو۔

source: You're helping Common Voice reach our daily sentence goals!
bft: یانگی نیالا روخ بین یودپن کامن واٸسی جق ہرژیسی تم کن زدما فری

source: Your email address
bft: یری ای میل پو

source: You respond or reply to it as naturally as you can
bft: یانگلا نینفو ژے دیولا سنگ تنگسے تم لزوق بیوس۔

source: Your files are being assembled. Please check again later.
bft: یری فایل کن دمسین یود۔ جوکلا ینگ ہلتوس

source: Your Languages
bft: یری سکت کن

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
bft: یری سکت پو کلپ پینگ میدوک، یانگ تھدنارے یری سکت پینگ یانگسہ تم سیر ہلتالا یانگلا سیٹینگ پو تبدیل بیا نگینید

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
bft: یتی سکت پینگ ینگ دی لوکھسینگ ینگ سیرا میدپا ژوخ یود۔ اما یانگ تھدنہ،ینگ تم سیر یودا مید ہلتا لا سیٹینگ پو تبدیل بیس۔

source: Your username and email will not be associated with the published data.
bft: یری کولبی مینتخپو نہ ای میل پو فودے تنگفی ڈیٹو نہ یمبو می مینمن۔

source: Your weekly goal has been created
bft: یری ہفتی خسم لوکھ پو فچوسید

source: You should receive an email shortly explaining the steps to get your language added to Common Voice
bft: یانگلا شوخمویکھہ یری سکت پو کامن وایسکھہ ایڈ بیوفری تمپو شوٹ چوگینچی ای میل چی چیک تھوبہ رگوسپن

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
bft: یانگی روخ بیسید، <goalPercentage> </goalPercentage> کامن واٸیس، نٸی جغی،{ $goalValue } زون لوکھسینگ

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
bft: یانگی کامن واٸس لا روخ بیسید، نٸی جغی مقصدی لوکھسینگنو

source: You've successfully signed up for contributing to { $language }. Thank you.
bft: یانگ روخ بیا فری لیاخمویکھہ جوکھ لم لا تھونسید۔ یری شیزدے

source: You want to join the Common Voice mailing list
bft: کامن وایسی میلینگ لسٹ پینگ گوا تھدیتا؟

source: You write down what you hear in the audio clips
bft: یانگلا سکتی کلپ پینگنو کوسپو چوق ربین۔

source: Zaza
bft: زازا

source: Zip #{ $offset } of { $total }
bft: زیپ #{ $offset } کا/کے { $total }

source: Zulu
bft: زولو

source: account recovery key
bft: زبسے یقپی لیمک

source: add-on
bft: روخ بیس

source: alternate text
bft: سکن پھالو

source: attack
bft: ہرمقسہ

source: attacker
bft: ہرمقسہ بیکھن

source: Attack Site
bft: ہرمقسی ملسہ

source: attendee
bft: اونگکھن کن

source: authenticate
bft: ٹرچھت بیوس

source: authenticated
bft: ٹرچھت

source: authentication code
bft: چھدکھی پھالونگ

source: autoplay
bft: رنگ درول

source: backup authentication code
bft: فسقسے یقپی لیمک

source: bookmark
bft: فسقسے یوق

source: breakpoint
bft: لم سترانگی برمل

source: Bug report
bft: بجیکسہ ہلتن کھن

source: certificate authority
bft: چھدکھہ مین کھن

source: cipher
bft: خسنگ تمی اشی

source: clipboard
bft: تم کھور

source: colorway
bft: رنگ بوری چتق

source: confirmation code
bft: چھدکھی پھالونگ

source: context
bft: لوکھسینگنو

source: cookie banner
bft: لس تھیب

source: corrupt
bft: بجیکس

source: corrupted
bft: میکھوسپہ سونگفو

source: crash
bft: بجیکسے سونگ

source: cross-site tracking cookie
bft: سنتری پا

source: cryptominer
bft: جنمی غزبی ژالکھن

source: cryptomining
bft: جنمی غزبی

source: debug
bft: بجیکھ لمپو ژول

source: deceptive site
bft: میک لونگپھی ملسہ

source: decode
bft: شوپ کھڑول

source: decryption
bft: شوپ فیس

source: disinformation
bft: تم مین

source: distrust
bft: سننگ چھق

source: email mask
bft: ای میلی غدونگ شوپ

source: enable
bft: ہلژوپ

source: encode
bft: شوپ کول

source: encrypt
bft: شوپ سکون

source: encryption
bft: شوپ سکون

source: end user
bft: کولکھن

source: Enhanced Tracking Protection
bft: لیگی بیورمو سترونگکھن

source: extension
bft: لق تھوت مینکھن

source: fingerprinter
bft: سین رزیسی چتق

source: fingerprinting
bft: سین رزیس

source: Firefox View
bft: فاٰیر فوکسی غدونگکھہ

source: grassroots
bft: رمپی ژھول کن

source: home page
bft: ملی غدونگکھہ

source: import
bft: فیرولنہ کھیونگ

source: independent browser
bft: رانگ بیونگ

source: innovations
bft: رانگ فچوس

source: insecure
bft: بجیکپہ چن

source: installation
bft: فچوکھہ/ہلژونگ

source: Issue
bft: ہرکپھلس

source: Legacy extension
bft: سنیگمہ میکھوسپی چتق

source: MDN
bft: ایم ڈی این، موزیلا فچوکھن کن

source: misinformation
bft: غزون تم

source: native
bft: یول می

source: net neutrality
bft: گانگمہ لا درا درا من

source: nonprofit
bft: زدے میت

source: non-profit
bft: مزرو میدپی

source: open source
bft: کھڑولے یود پی چتق

source: override
bft: لم فسور

source: phone number mask
bft: فون نمبری غدونگ شوپ

source: pop-up
bft: کرکوم پو

source: preference
bft: غدمسنہ

source: Privacy Notice
bft: خسنگ تم

source: release
bft: پھودے تونگ

source: report
bft: سکت کھیر

source: restricted site
bft: موخچن ملسہ

source: revert
bft: لزوق

source: Review checker
bft: تم فسل بیکھن

source: search suggestion
bft: ژلبی جلتہ

source: security keys
bft: سترونگ لوکھسی چتق

source: sensitive
bft: سنگیو سنگیو

source: sidebar
bft: بیا تیق

source: sign
bft: ہرتخنہ

source: signer
bft: ربیکھن

source: sign in
bft: جوکھس

source: sign-in
bft: جوکھسہ

source: studies
bft: فرالوکھ

source: Terms of Service
bft: لس کھومی تم کن

source: track
bft: ژول

source: trackers
bft: ہلتا سترونگ بیکھن

source: Tracking Content
bft: سترونگ کھن

source: unencrypted
bft: زگوہلٹن میدپہ

source: unresponsive
bft: تم میکو

source: unsafe
bft: زُور زُور

source: validate
bft: چھدکھہ بیس

source: validity
bft: چھدکھہ

source: version
bft: پھڑوسنہ

source: Web Authentication
bft: ویبی چھدکھی ہرتخنونگ
